app/Controllers/Admin.php

SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE `status` = 'completed'
AND YEAR(payment_date) = '2026'
AND MONTH(payment_date) = '08'
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE `status` = 'completed'
AND YEAR(payment_date) = '2026'
AND MONTH(payment_date) = '07'
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE YEAR(created_at) = '2026'
AND MONTH(created_at) = '08'
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE YEAR(created_at) = '2026'
AND MONTH(created_at) = '07'
---
    public function dashboard()
    {
        // Get current month and previous month for comparison
        $currentMonth = date('Y-m');
        $previousMonth = date('Y-m', strtotime('-1 month'));

        // Calculate percentage changes
        $currentRevenue = $this->paymentModel->selectSum('amount')
            ->where('status', 'completed')
            ->where('YEAR(payment_date)', date('Y'))
            ->where('MONTH(payment_date)', date('m'))
            ->get()->getRow()->amount ?? 0;

        $previousRevenue = $this->paymentModel->selectSum('amount')
            ->where('status', 'completed')
            ->where('YEAR(payment_date)', date('Y', strtotime('-1 month')))
            ->where('MONTH(payment_date)', date('m', strtotime('-1 month')))
            ->get()->getRow()->amount ?? 0;

        $revenueChange = $previousRevenue > 0 ? (($currentRevenue - $previousRevenue) / $previousRevenue) * 100 : 0;

        // Calculate reservations change
        $currentReservations = $this->reservationModel
            ->where('YEAR(created_at)', date('Y'))
            ->where('MONTH(created_at)', date('m'))
            ->countAllResults();

        $previousReservations = $this->reservationModel
            ->where('YEAR(created_at)', date('Y', strtotime('-1 month')))
            ->where('MONTH(created_at)', date('m', strtotime('-1 month')))
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'customer'
AND YEAR(created_at) = '2026'
AND MONTH(created_at) = '08'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'customer'
AND YEAR(created_at) = '2026'
AND MONTH(created_at) = '07'
---
        $reservationsChange = $previousReservations > 0 ? (($currentReservations - $previousReservations) / $previousReservations) * 100 : 0;

        // Calculate customers change
        $currentCustomers = $this->userModel->where('role', 'customer')
            ->where('YEAR(created_at)', date('Y'))
            ->where('MONTH(created_at)', date('m'))
            ->countAllResults();

        $previousCustomers = $this->userModel->where('role', 'customer')
            ->where('YEAR(created_at)', date('Y', strtotime('-1 month')))
            ->where('MONTH(created_at)', date('m', strtotime('-1 month')))
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `cars`
WHERE `status` = 'available'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'customer'
SELECT COUNT(*) AS `numrows` FROM `reservations`
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `status` = 'pending'
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE `status` = 'completed'
---
            'title' => 'Admin Dashboard',
            'stats' => [
                'total_cars' => $this->carModel->countAll(),
                'available_cars' => $this->carModel->where('status', 'available')->countAllResults(),
                'total_customers' => $this->userModel->where('role', 'customer')->countAllResults(),
                'total_reservations' => $this->reservationModel->countAll(),
                'pending_reservations' => $this->reservationModel->where('status', 'pending')->countAllResults(),
                'total_revenue' => $this->paymentModel->selectSum('amount')->where('status', 'completed')->get()->getRow()->amount ?? 0,

SELECT DATE(payment_date) as date, SUM(amount) as revenue
FROM `payments`
WHERE `status` = 'completed'
AND `payment_date` >= '2026-07-08'
AND `payment_date` <= '2026-08-07'
GROUP BY DATE(payment_date)
ORDER BY `date` ASC
---
    public function getRevenueData()
    {
        $days = $this->request->getGet('days') ?? 30;

        // Calculate start date based on days parameter
        $startDate = date('Y-m-d', strtotime("-$days days"));
        $endDate = date('Y-m-d');

        // Get revenue data for the period
        $revenueData = $this->paymentModel->select("DATE(payment_date) as date, SUM(amount) as revenue")
            ->where('status', 'completed')
            ->where('payment_date >=', $startDate)
            ->where('payment_date <=', $endDate)
            ->groupBy('DATE(payment_date)')
            ->orderBy('date', 'ASC')
            ->get()
            ->getResultArray();

SELECT `reservations`.*, `users`.`name` as `customer_name`, `cars`.`brand`, `cars`.`model`
FROM `reservations`
JOIN `users` ON `users`.`id` = `reservations`.`user_id`
JOIN `cars` ON `cars`.`id` = `reservations`.`car_id`
ORDER BY `reservations`.`created_at` DESC
 LIMIT 5
SELECT *
FROM `cars`
ORDER BY `created_at` DESC
 LIMIT 3
---
    private function getRecentActivity()
    {
        $activity = [];

        // Get recent reservations
        $recentReservations = $this->reservationModel
            ->select('reservations.*, users.name as customer_name, cars.brand, cars.model')
            ->join('users', 'users.id = reservations.user_id')
            ->join('cars', 'cars.id = reservations.car_id')
            ->orderBy('reservations.created_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

        foreach ($recentReservations as $reservation) {
            $timeAgo = $this->getTimeAgo($reservation['created_at']);

            $activity[] = [
                'title' => 'New reservation',
                'description' => $reservation['brand'] . ' ' . $reservation['model'] . ' • ' . $reservation['customer_name'],
                'time_ago' => $timeAgo,
                'icon' => 'fa-calendar-check',
                'color' => 'var(--success)',
                'bg_color' => 'rgba(16, 185, 129, 0.1)'
            ];
        }

        // Get recent car additions
        $recentCars = $this->carModel
            ->orderBy('created_at', 'DESC')
            ->limit(3)
            ->get()
            ->getResultArray();

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
public function profile()
{
    $userId = session()->get('userId');
    $user = $this->userModel->find($userId);

UPDATE `users` SET `name` = 'Admin', `phone` = '1234567890', `address` = '123 Admin Street, City, State', `updated_at` = '2026-08-07 07:29:56', `email` = 'admin@gmail.com'
WHERE `users`.`id` IN ('1')
---
            $updateData['email'] = $newEmail;
        }

        if ($this->userModel->update($userId, $updateData)) {