app/Controllers/Customer.php

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
    public function profile()
{
    $userModel = new \App\Models\UserModel();
    $userId = session()->get('userId');
    $user = $userModel->find($userId);

UPDATE `users` SET `name` = 'Customer', `phone` = '09273532291', `address` = 'Zone 3 Bonbon', `updated_at` = '2026-08-07 07:29:35', `email` = 'customer@gmail.com'
WHERE `users`.`id` IN ('7')
---
            $updateData['email'] = $newEmail;
        }

        if ($userModel->update($userId, $updateData)) {