app/Models/CarModel.php

SELECT *
FROM `cars`
WHERE `status` = 'available'
ORDER BY `brand` ASC, `model` ASC
---
    public function getAvailableCars()
    {
        return $this->where('status', 'available')
                    ->orderBy('brand', 'ASC')
                    ->orderBy('model', 'ASC')
                    ->findAll();